Revit 2026 API

# CableSizeNeutralConductorSize Property

---

The size of a Neutral Conductor.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId NeutralConductorSize { get; set; }
```
```vb
Public Property NeutralConductorSize As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ NeutralConductorSize {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member NeutralConductorSize : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The id is not a Conductor Size id nor invalidElementId. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

Each Neutral Conductor has the same size.

#### Reference

CableSize Class

Autodesk.Revit.DB.Electrical Namespace